cf_billing/Catalogs/энргСпособСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСпособСвязи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтапПИР</Name>
					<Comment>Переопределен на табличную часть(Этапы ПИР).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиСогласующих</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапПИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаМакетовПФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Макет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргСпособСвязи/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПолучениеДанных

// Функция - Получить список параметров
//
// Параметры:
//  ТипСобытия	 - СправочникСсылка.энргСпособСвязи - Тип события. 
// 
// Возвращаемое значение:
//  Массив - список параметров.
//
Функция ПолучитьСписокПараметров(ТипСобытия) Экспорт 

	Если Не ЗначениеЗаполнено(ТипСобытия) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСпособСвязиПараметры.Параметр КАК Параметр
		|ИЗ
		|	Справочник.энргСпособСвязи.Параметры КАК энргСпособСвязиПараметры
		|ГДЕ
		|	энргСпособСвязиПараметры.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	энргСпособСвязиПараметры.НомерСтроки";
	
	Запрос.Параметры.Вставить("Ссылка", ТипСобытия);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

// Функция - Получить список макетов ПФ
//
// Параметры:
//  ТипСобытия	 - СправочникСсылка.энргСпособСвязи - Тип события. 
// 
// Возвращаемое значение:
//  Массив - список макетов. 
//
Функция ПолучитьСписокМакетовПФ(ТипСобытия) Экспорт 

	Если Не ЗначениеЗаполнено(ТипСобытия) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(энргСпособСвязиНастройкаМакетовПФ.Макет) КАК Макет
		|ИЗ
		|	Справочник.энргСпособСвязи.НастройкаМакетовПФ КАК энргСпособСвязиНастройкаМакетовПФ
		|ГДЕ
		|	энргСпособСвязиНастройкаМакетовПФ.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	энргСпособСвязиНастройкаМакетовПФ.НомерСтроки";
	
	Запрос.Параметры.Вставить("Ссылка", ТипСобытия);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
КонецФункции 

// Функция - Получить доступные этапы ПИР
//
// Параметры:
//  ТипСобытия	 - СправочникСсылка.энргСпособСвязи - Тип события. 
// 
// Возвращаемое значение:
//  Массив - список этапов ПИР. 
//
Функция ПолучитьДоступныеЭтапыПИР(ТипСобытия) Экспорт 
	Если НЕ ЗначениеЗаполнено(ТипСобытия) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСпособСвязиЭтапыПИР.ЭтапПИР КАК ЭтапПИР
		|ИЗ
		|	Справочник.энргСпособСвязи.ЭтапыПИР КАК энргСпособСвязиЭтапыПИР
		|ГДЕ
		|	энргСпособСвязиЭтапыПИР.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", ТипСобытия);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЭтапПИР");
КонецФункции

// Функция - Получить роли согласующих
//
// Параметры:
//  ТипСобытия	 - СправочникСсылка.энргСпособСвязи - Тип события. 
// 
// Возвращаемое значение:
//  Массив - список ролей. 
//
Функция ПолучитьРолиСогласующих(ТипСобытия) Экспорт
	Если НЕ ЗначениеЗаполнено(ТипСобытия) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСпособСвязиРолиСогласующих.Роль КАК Роль
		|ИЗ
		|	Справочник.энргСпособСвязи.РолиСогласующих КАК энргСпособСвязиРолиСогласующих
		|ГДЕ
		|	энргСпособСвязиРолиСогласующих.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", ТипСобытия);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Роль");
КонецФункции

// Функция - Получить массив доступных типов событий
//
// Параметры:
//  ЭтапПИР	 - СправочникСсылка.энргВидыОперацийПИД - Этап ПИР. 
// 
// Возвращаемое значение:
//  Массив - Массив типов событий.
//
Функция ПолучитьМассивДоступныхТиповСобытий(ЭтапПИР) Экспорт
	Если НЕ ЗначениеЗаполнено(ЭтапПИР) Тогда
		Возврат Новый Массив;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСпособСвязи.Ссылка КАК ТипСобытия,
		|	энргСпособСвязиЭтапыПИР.ЭтапПИР КАК ЭтапПИР
		|ПОМЕСТИТЬ ЭтапыПИРСобытий
		|ИЗ
		|	Справочник.энргСпособСвязи КАК энргСпособСвязи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСпособСвязи.ЭтапыПИР КАК энргСпособСвязиЭтапыПИР
		|		ПО энргСпособСвязи.Ссылка = энргСпособСвязиЭтапыПИР.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ТипСобытия КАК ТипСобытия
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.ТипСобытия КАК ТипСобытия
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ЭтапыПИРСобытий.ТипСобытия КАК ТипСобытия,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭтапыПИРСобытий.ЭтапПИР) КАК КоличествоЭтапов
		|		ИЗ
		|			ЭтапыПИРСобытий КАК ЭтапыПИРСобытий
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЭтапыПИРСобытий.ТипСобытия) КАК ВложенныйЗапрос
		|	ГДЕ
		|		ВложенныйЗапрос.КоличествоЭтапов = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭтапыПИРСобытий.ТипСобытия
		|	ИЗ
		|		ЭтапыПИРСобытий КАК ЭтапыПИРСобытий
		|	ГДЕ
		|		ЭтапыПИРСобытий.ЭтапПИР = &ЭтапПИР) КАК ВложенныйЗапрос";
	
	Запрос.Параметры.Вставить("ЭтапПИР", ЭтапПИР);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипСобытия");
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
